- 
renaming of columns 
- select data to display

In [6]:
import pandas as pd

#enter students dictornary 

students =  {"Corey": [63,75,88], "Kevin": [48,98,92], "Akshay": [87,86,85]}


#convert to DataFrame

dF = pd.DataFrame (students)

#tranpose it (change columns and rows )

dF = dF.T
dF

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [33]:
#rename the colums to quiz 1, ... (change ALL colums)

dF.columns =["Quiz1", "Quiz2", "Quiz3"]
dF

       Quiz1  Quiz2  Quiz3
Corey     63     75     88
Kevin     48     98     92
Jolly     87     86     85

In [36]:
#rename rows 
new= dF.rename (index = {'Akshay': 'Jolly'})
new

       Quiz1  Quiz2  Quiz3
Corey     63     75     88
Kevin     48     98     92
Jolly     87     86     85

In [45]:
#only display a certain part of the DataFrame 
#first row (index)
dF.iloc[0]
#or
dF.iloc[0,:]

Quiz1    63
Quiz2    75
Quiz3    88
Name: Corey, dtype: int64

In [41]:
#first row, first column 
dF. iloc[0,0]

63

In [48]:
#select column with keyword 
dF["Quiz2"]

Corey    75
Kevin    98
Jolly    86
Name: Quiz2, dtype: int64

In [52]:
#only show Jolly
dF.iloc[2,:]

Quiz1    87
Quiz2    86
Quiz3    85
Name: Jolly, dtype: int64

In [53]:
#select column with dot (.)
dF.Quiz1

Corey    63
Kevin    48
Jolly    87
Name: Quiz1, dtype: int64

In [54]:
dF.Quiz3

Corey    88
Kevin    92
Jolly    85
Name: Quiz3, dtype: int64

In [55]:
#access first column by index 
dF.iloc [:, 0]

Corey    63
Kevin    48
Jolly    87
Name: Quiz1, dtype: int64

In [66]:
#gives the main statistics!

round (dF.describe(),0)

       Quiz1  Quiz2  Quiz3
count    3.0    3.0    3.0
mean    66.0   86.0   88.0
std     20.0   12.0    4.0
min     48.0   75.0   85.0
25%     56.0   80.0   86.0
50%     63.0   86.0   88.0
75%     75.0   92.0   90.0
max     87.0   98.0   92.0

In [63]:
#other data type: SERIES 
?pd.DataFrame